Repository: Kaiyrtay/Q-Hub
Catalog: qualification_hub/locale/*/LC_MESSAGES/django.po
Languages: kk

source: Russian
kk: Русский язык

source: Kazakh
kk: Қазақ тілі

source: Delete Certificate
kk: Сертификатты жою

source: Delete certificate
kk: Сертификатты жою

source: Are you sure you want to delete
kk: Жойғыңыз келетініне сенімдісіз бе

source: Delete
kk: Жою

source: Back to List
kk: Тізімге оралу

source: Certificate Detail
kk: Сертификат туралы мәліметтер

source: Organization
kk: Ұйым

source: Description
kk: Сипаттама

source: Expiration Date
kk: Жарамдылық мерзімі

source: Issued By
kk: Берілген

source: Certificate Number
kk: Сертификат нөмірі

source: Date Earned
kk: Алынған күні

source: Verification URL
kk: Растау URL мекенжайы

source: Owner
kk: Иесі

source: Edit Certificate
kk: Сертификатты өңдеу

source: Back to Certificate List
kk: Сертификаттар тізіміне оралу

source: Create New Certificate
kk: Жаңа сертификат қосу

source: Save changes
kk: Өзгерістерді сақтау

source: Create
kk: Жасау

source: Back to Certificates List
kk: Сертификаттар тізіміне оралу

source: Certificate List
kk: Сертификаттар тізімі

source: View Details
kk: Мәліметтерді қарау

source: Page navigation
kk: Беттерді шарлау

source: Previous
kk: Алдыңғы

source: Next
kk: Келесі

source: Search Results
kk: Іздеу нәтижелері

source: Error
kk: Қате

source: certificates
kk: сертификаттар

source: Teacher
kk: Мұғалім

source: Student
kk: Студент

source: No owner assigned
kk: Иесі тағайындалмаған

source: Warning
kk: Ескерту

source: No certificates from
kk: Сертификаттар жоқ

source: Departments
kk: Кафедралар

source: No certificates found.
kk: Сертификаттар табылған жоқ.

source: Managers
kk: Менеджерлер

source: Teachers
kk: Мұғалімдер

source: Students
kk: Студенттер

source: Delete Department
kk: Кафедраны алып тастау

source: Are you sure you want to delete this
kk: Сіз мұны жойғыңыз келетініне сенімдісіз бе

source: department
kk: кафедра

source: Department
kk: Kафедра

source: Head of Department
kk: Кафедра басшысы

source: Number of Managers
kk: Менеджерлер саны

source: Number of Teachers
kk: Мұғалімдер саны

source: Number of Students
kk: Студенттер саны

source: Edit
kk: Өңдеу

source: Department Form
kk: Кафедра формасы

source: Edit Department
kk: Кафедраны редакциялау

source: Create New Department
kk: Жаңа кафедра қосу

source: Save Changes
kk: Өзгерістерді сақтау

source: Department Name
kk: Кафедра атауы

source: Department Head
kk: Кафедра басшысы

source: Faculty
kk: Факультет

source: Actions
kk: Әрекеттер

source: Not Assigned
kk: Тағайындалған жоқ

source: No departments found.
kk: Бірде-бір кафедра табылған жоқ

source: Create a new department
kk: Жаңа кафедра қосу

source: Delete Faculty
kk: Факультетті жою

source: faculty? This action cannot be undone.
kk: факультет? Бұл әрекетті қайтару мүмкін емес.

source: Dean of Faculty
kk: Факультет деканы

source: Location
kk: Орналасқан жері

source: Website
kk: Веб-сайт

source: Visit Website
kk: Веб-сайтқа кіріңіз

source: Not Available
kk: Қол жетімді емес

source: Contact Email
kk: Байланыс электрондық поштасы

source: Number of Departments
kk: Кафедралар саны

source: No departments are associated with this faculty.
kk: Бұл факультетпен ешқандай кафедралар байланысы жоқ.

source: Faculty Form
kk: Факультет формасы

source: Edit Faculty
kk: Факультетті өңдеу

source: Create New Faculty
kk: Жаңа факультет қосу

source: Back to Faculty List
kk: Факультеттер тізіміне оралу

source: Faculties
kk: Факультеттер

source: Faculty Name
kk: Факультет атауы

source: Dean
kk: Декан

source: Created At
kk: Құрылған

source: No faculties found.
kk: Факультеттер табылған жоқ.

source: Create a new faculty
kk: Жаңа факультет қосу

source: About Us
kk: Біз туралы

source: Q-hub is a platform dedicated to connecting students, teachers, and professionals. Learn more about our mission, vision, and values.
kk: Q-hub - бұл студенттерді, мұғалімдерді және кәсіби мамандарды байланыстыруға арналған платформа. Біздің миссиямыз, көзқарасымыз және құндылықтарымыз туралы көбірек біліңіз.

source: Quick Links
kk: Жылдам сілтемелер

source: Home
kk: Басты бет

source: Certificates
kk: Марапаттар

source: Contact Us
kk: Бізбен байланысыңыз

source: Email
kk: Электрондық пошта (e-mail)

source: Phone
kk: Телефон

source: Address
kk: Мекенжайы (адрес)

source: All rights reserved.
kk: Барлық құқықтар қорғалған.

source: Welcome to Qualification Hub
kk: Қош келдіңіз Qualification Hub-қа!

source: Easily upload, organize, and access your university certificates in one place. Keep track of your academic achievements and share them with employers or educational institutions.
kk: Ыңғайлы жүктеу, жүйелеу және қол жетімділік жеке сертификаттар бір жерде. Академиялық сабақтарыңызды қадағалаңыз және оларды жұмыс берушілермен немесе оқу орындарымен бөлісіңіз.

source: Join to us!
kk: Қосылыңыз!

source: Delete Manager
kk: Менеджерді жою

source: Delete manager
kk: Менеджерді жою

source: manager? This will also delete the associated user. This action cannot be undone.
kk: менеджерді жойғыңыз келе ме? Бұл байланысты пайдаланушыны да жояды. Бұл әрекетті болдырмау мүмкін емес.

source: Manager
kk: Менеджер

source: Manager Details
kk: Менеджер туралы мәліметтер

source: Full Name
kk: Толық аты-жөні

source: Role
kk: Рөлі

source: Appointed Date
kk: Тағайындалған күні

source: Phone Number
kk: Телефон нөмірі

source: Update
kk: Жаңарту

source: Edit Manager
kk: Менеджерді өңдеу

source: Create New Manager
kk: Жаңа менеджер қосу

source: Managers List
kk: Менеджерлер тізімі

source: Managers Without Departments
kk: Тағайындалмаған менеджерлер

source: The database currently has no data; it's completely empty.
kk: Мәліметтер базасы қазіргі уақытта деректер жоқ; ол мүлдем бос.

source: Language
kk: Тілдер

source: Hello
kk: Сәлем

source: Logout
kk: Шығу

source: Sign Up
kk: Тіркелу

source: Sign In
kk: Кіру

source: Login
kk: Кіру

source: Welcome
kk: Қош келдіңіз

source: Login Image
kk: Кіру суреті

source: Not a member yet
kk: Әлі тіркелмеген сіз бе?

source: Register now
kk: Қазір тіркеліңіз

source: Log in
kk: Кіру

source: Email or Username
kk: Email немесе пайдаланушы аты

source: Password
kk: Құпия сөз

source: Keep me logged in
kk: Мені жүйеде қалдыру

source: Log in now
kk: Қазір кіру

source: Forgot password
kk: Құпия сөзді ұмыттыңыз ба?

source: Password Reset Successful
kk: Құпия сөзді қалпына келтіру сәтті аяқталды

source: Congratulations! Your password has been successfully reset. You can now log in with your new password.
kk: Құттықтаймыз! Сіздің құпия сөзіңіз сәтті қалпына келтірілді. Енді жаңа құпия сөзіңізбен кіре аласыз.

source: log in
kk: кіру

source: with your new password.
kk: жаңа құпия сөзіңізбен.

source: If you're using a password manager, don't forget to update it with your new password for seamless access.
kk: Егер сіз құпия сөз менеджерін пайдалансаңыз, үздіксіз қол жетімділік үшін оны жаңа құпия сөзіңізбен жаңартуды ұмытпаңыз.

source: If you encounter any issues logging in or have questions, please contact our support team for assistance.
kk: Егер жүйеге кіру кезінде қиындықтар туындаса немесе сұрақтарыңыз болса, көмек алу үшін біздің қолдау тобына хабарласыңыз.

source: Thank you for choosing our platform. We're glad to have you back!
kk: Біздің платформаны таңдағаныңыз үшін рахмет. Сізді қайта көргенімізге қуаныштымыз!

source: Set a New Password
kk: Жаңа құпия сөзді орнату

source: Welcome!
kk: Қош келдіңіз!

source: Password Image
kk: Құпия сөз бейнесі

source: Not a member yet?
kk: Әлі мүшесі емессіз бе?

source: To ensure your account's security, please enter your new password twice. Make sure to choose a unique and secure password.
kk: Есептік жазбаңыздың қауіпсіздігін қамтамасыз ету үшін жаңа құпия сөзіңізді екі рет енгізіңіз. Бірегей және қауіпсіз құпия сөз таңдағаныңызға көз жеткізіңіз.

source: Reset Password
kk: Құпия сөзді қалпына келтіру

source: Tips for a Strong Password:
kk: Күшті құпия сөзге арналған кеңестер:

source: Use a mix of uppercase and lowercase letters, numbers, and symbols.
kk: Үлкен және кіші әріптерді, сандарды және таңбаларды араластырыңыз.

source: Avoid common words, phrases, or easily guessed patterns.
kk: Жалпы сөздерден, сөз тіркестерінен немесе оңай болжанатын үлгілерден аулақ болыңыз.

source: Consider using a password manager to generate and store secure passwords.
kk: Қауіпсіз құпия сөздерді жасау және сақтау үшін құпия сөз реттеушісін пайдалануды қарастырыңыз.

source: If you encounter any issues during this process, please contact our support team for assistance.
kk: Осы процесс барысында қандай да бір мәселелерге тап болсаңыз, көмек алу үшін қолдау көрсету тобына хабарласыңыз.

source: Back to Home
kk: Үйге оралу

source: Check Your Email
kk: электрондық поштаңызды тексеріңіз

source: We have sent password reset instructions to the email address you provided. If an account with that email exists, you should receive an email shortly.
kk: Сіз берген электрондық пошта мекенжайына құпия сөзді қалпына келтіру нұсқауларын жібердік. Егер осы электрондық поштасы бар тіркелгі бар болса, сізге жақын арада электрондық хат келуі керек.

source: Didn't receive the email? Here are some things to check:
kk: Электрондық поштаны алған жоқсыз ба? Мұнда тексеру керек нәрселер бар:

source: Ensure the email address you entered is correct.
kk: Электрондық пошта мекенжайын дұрыс көрсеткеніңізге көз жеткізіңіз.

source: Check your spam or junk folder; sometimes the email might end up there.
kk: Спам қалтасын тексеріңіз; кейде электрондық пошта дәл сол жерде болуы мүмкін.

source: Give it a few minutes, as email delivery can sometimes be delayed.
kk: Бұған бірнеше минут бөліңіз, өйткені электрондық поштаны жеткізу кейде кешіктірілуі мүмкін.

source: If you've tried these steps and still haven't received the email, please contact our support team for further assistance.
kk: Егер сіз осы қадамдарды орындап көрген болсаңыз және әлі де электрондық поштаны алмасаңыз, қосымша көмек алу үшін қолдау көрсету тобына хабарласыңыз.

source: Reset Your Password
kk: Құпия сөзді қалпына келтіріңіз

source: Password Reset Image
kk: Құпия сөзді қалпына келтіру кескіні

source: If you've forgotten your password, enter your email address below, and we'll send you a link to reset it.
kk: Құпия сөзіңізді ұмытып қалсаңыз, төменде электрондық пошта мекенжайыңызды енгізіңіз, біз сізге оны қалпына келтіру үшін сілтеме жібереміз.

source: Email Address
kk: Электрондық поштаның адресі

source: Enter your email
kk: Электрондық поштаңызды енгізіңіз

source: Send Reset Link
kk: Қалпына келтіру сілтемесін жіберу

source: After you receive the email, click the link to set your new password. If you don't get the email, check your spam/junk folder or contact support.
kk: Электрондық поштаны алғаннан кейін жаңа құпия сөзді орнату үшін сілтемені басыңыз. Электрондық поштаны алмасаңыз, спам/қалаусыз қалтаңызды тексеріңіз немесе қолдау қызметіне хабарласыңыз.

source: Register
kk: Тіркелу

source: Welcome to Registration
kk: Тіркеуге қош келдіңіз

source: Registration Image
kk: Тіркеу суреті

source: Already have an account
kk: Тіркелгі бар

source: What are you looking for
kk: Сіз не іздейсіз

source: Search
kk: Іздеу

source: Quick search
kk: Жылдам іздеу

source: username
kk: пайдаланушы аты

source: certificate organization
kk: сертификаттау ұйымы

source: certificate number
kk: сертификат нөмірі

source: Delete Student
kk: Студентті жою

source: Delete student
kk: Студентті жою

source: Are you sure you want to delete this
kk: Сіз мұны жойғыңыз келетініне сенімдісіз бе

source: student?This will also delete the associated user. This action cannot be undone.
kk: студент?Бұл сонымен қатар байланысты пайдаланушыны жояды. Бұл әрекетті қайтару мүмкін емес.

source: Student Details
kk: Студенттік Мәліметтер

source: Enrollment Date
kk: Қабылдау күні

source: Add New Certificate
kk: Жаңа сертификат қоcy

source: Edit Student
kk: Студент деректерін өңдеу

source: Create New Student
kk: Жаңа студент қосу

source: Students List
kk: Студенттер тізімі

source: Major
kk: Oсновная степень

source: Students Without Departments
kk: Не закрепленные студенты

source: Delete Teacher
kk: Мұғалімді жою

source: Delete teacher
kk: Мұғалімді жою

source: Are you sure you want to delete this
kk: Сіз мұны жойғыңыз келетініне сенімдісіз бе

source: teacher?This will also delete the associated user. This action cannot be undone.
kk: мұғалім?Бұл да болады байланысты пайдаланушыны жойыңыз. Бұл әрекетті қайтару мүмкін емес.

source: Teacher Details
kk: Мұғалім туралы мәліметтер

source: Hire Date
kk: Жұмысқа қабылдау күні

source: Edit Teacher
kk: Мұғалім деректерін өңдеу

source: Create New Teacher
kk: Жаңа мұғалім қосy

source: Teachers List
kk: Мұғалімдер тізімі

source: Subject Taught
kk: Оқытылатын пән

source: Room Number
kk: Аудитория

source: Teachers Without Departments
kk: Мұғалімдер тағайындалмаған
